c5/src/Catalogs/UserSettings/UserSettings.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>UserSettings</name>
  <owners>Catalog.Users</owners>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>Department</name>
    <type>
      <types>CatalogRef.Departments</types>
    </type>
  </attributes>
  <attributes>
    <name>Folder</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Mailbox</name>
    <type>
      <types>CatalogRef.Mailboxes</types>
    </type>
  </attributes>
  <attributes>
    <name>MailCheck</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>MeetingNotifications</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>PaymentLocation</name>
    <type>
      <types>CatalogRef.PaymentLocations</types>
    </type>
  </attributes>
  <attributes>
    <name>Stock</name>
    <type>
      <types>CatalogRef.Warehouses</types>
    </type>
  </attributes>
  <attributes>
    <name>TimesheetNotifications</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Warehouse</name>
    <type>
      <types>CatalogRef.Warehouses</types>
    </type>
  </attributes>
  <attributes>
    <name>Workshop</name>
    <type>
      <types>CatalogRef.Warehouses</types>
    </type>
  </attributes>
</mdclass:Catalog>

c5/src/Catalogs/Users/Users.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Users</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>AccessDenied</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>AccessRevoked</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ApproveSalesOrders</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ChangeInternalOrders</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ChangeSalesOrders</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CompanyAccess</name>
    <type>
      <types>EnumRef.Access</types>
    </type>
  </attributes>
  <attributes>
    <name>Email</name>
    <type>
      <types>DefinedType.Email</types>
    </type>
  </attributes>
  <attributes>
    <name>Employee</name>
    <type>
      <types>CatalogRef.Employees</types>
    </type>
  </attributes>
  <attributes>
    <name>FirstName</name>
    <type>
      <types>DefinedType.Name</types>
    </type>
  </attributes>
  <attributes>
    <name>FullName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Gender</name>
    <type>
      <types>EnumRef.Sex</types>
    </type>
  </attributes>
  <attributes>
    <name>Language</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>LastName</name>
    <type>
      <types>DefinedType.Name</types>
    </type>
  </attributes>
  <attributes>
    <name>Login</name>
    <type>
      <types>CatalogRef.Logins</types>
    </type>
  </attributes>
  <attributes>
    <name>OrganizationAccess</name>
    <type>
      <types>EnumRef.Access</types>
    </type>
  </attributes>
  <attributes>
    <name>OSAuth</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>OSUser</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Patronymic</name>
    <type>
      <types>DefinedType.Name</types>
    </type>
  </attributes>
  <attributes>
    <name>Protection</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Show</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>TimeZone</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>TrackingDistance</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>TrackingPeriodicity</name>
    <type>
      <types>EnumRef.Frequency</types>
    </type>
  </attributes>
  <attributes>
    <name>TrackingProvider</name>
    <type>
      <types>EnumRef.Providers</types>
    </type>
  </attributes>
  <attributes>
    <name>TrackingTime</name>
    <type>
      <types>EnumRef.Frequency</types>
    </type>
  </attributes>
  <attributes>
    <name>TrackLocation</name>
    <type>
      <types>EnumRef.Tracking</types>
    </type>
  </attributes>
  <attributes>
    <name>UserClass</name>
    <type>
      <types>EnumRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>WarehouseAccess</name>
    <type>
      <types>EnumRef.Access</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Companies</name>
    <attributes>
      <name>Company</name>
      <type>
        <types>CatalogRef.Companies</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Organizations</name>
    <attributes>
      <name>Organization</name>
      <type>
        <types>CatalogRef.Organizations</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>OrganizationsStates</name>
    <attributes>
      <name>State</name>
      <type>
        <types>CatalogRef.States</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Rights</name>
    <attributes>
      <name>RoleName</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Warehouses</name>
    <attributes>
      <name>Warehouse</name>
      <type>
        <types>CatalogRef.Warehouses</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>WarehousesStates</name>
    <attributes>
      <name>State</name>
      <type>
        <types>CatalogRef.States</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

c5/src/Catalogs/UserSettings/ObjectModule.bsl
var User;
var DataPath;

Procedure FillCheckProcessing ( Cancel, CheckedAttributes )

	setUser ();
	if ( not checkCompany () ) then
		Cancel = true;
	endif; 
	if ( not checkWarehouse () ) then
		Cancel = true;
	endif; 

EndProcedure

Procedure setUser ()
	
	var userForm;
	 
	if ( AdditionalProperties.Property ( Enum.AdditionalPropertiesWritingUser (), userForm ) ) then
		DataPath = userSettings ( userForm );
		User = userForm.Object;
	else
		DataPath = "Object";
		User = getUser ();
	endif;
	
EndProcedure

Function userSettings ( Form )
	
	s = Form.Items.Company.DataPath;
	return Left ( s, StrFind ( s, "." ) - 1 );
	
EndFunction

Function getUser ()
	
	s = "
	|select Users.CompanyAccess as CompanyAccess, Users.WarehouseAccess as WarehouseAccess,
	|	Users.Companies as Companies, Users.Warehouses as Warehouses
	|from Catalog.Users as Users
	|where Users.Ref = &Ref";
	q = new Query ( s );
	q.SetParameter ( "Ref", Owner );
	data = q.Execute ().Unload ();
	result = new Structure ( "Ref, CompanyAccess, WarehouseAccess, Companies, Warehouses", Ref );
	FillPropertyValues ( result, data [ 0 ] );
	return result;
	
EndFunction

Function checkCompany ()
	
	if ( User.CompanyAccess = Enums.Access.Undefined ) then
		return true;
	elsif ( User.CompanyAccess = Enums.Access.Allow ) then
		if ( companyInList () ) then
			return true;
		else
			Output.DefaultCompanyError1 ( , "Company", User.Ref, DataPath );
			return false;
		endif;
	elsif ( User.CompanyAccess = Enums.Access.Forbid ) then
		if ( companyInList () ) then
			Output.DefaultCompanyError2 ( , "Company", User.Ref, DataPath );
			return false;
		else
			return true;
		endif;
	endif; 
	
EndFunction 

Function companyInList ()
	
	return User.Companies.FindRows ( new Structure ( "Company", Company ) ).Count () > 0;
	
EndFunction 

Function checkWarehouse ()
	
	if ( User.WarehouseAccess = Enums.Access.Undefined ) then
		return true;
	elsif ( User.WarehouseAccess = Enums.Access.Allow ) then
		if ( warehouseInList () ) then
			return true;
		else
			Output.DefaultWarehouseError1 ( , "Warehouse", User.Ref, DataPath );
			return false;
		endif;
	elsif ( User.WarehouseAccess = Enums.Access.Forbid ) then
		if ( warehouseInList () ) then
			Output.DefaultWarehouseError2 ( , "Warehouse", User.Ref, DataPath );
			return false;
		else
			return true;
		endif;
	elsif ( User.WarehouseAccess = Enums.Access.States ) then
		if ( warehouseStateInList () ) then
			return true;
		else
			Output.DefaultWarehouseError3 ( , "Warehouse", User.Ref, DataPath );
			return false;
		endif;
	elsif ( User.WarehouseAccess = Enums.Access.Directly ) then
		if ( Warehouse.IsEmpty ()
			or DF.Pick ( Warehouse, "Responsible" ) = User.Ref ) then
			return true;
		else
			Output.DefaultWarehouseError4 ( , "Warehouse", User.Ref, DataPath );
			return false;
		endif;
	endif; 
	
EndFunction 

Function warehouseInList ()
	
	return User.Warehouses.FindRows ( new Structure ( "Warehouse", Warehouse ) ).Count () > 0;
	
EndFunction 

Function warehouseStateInList ()
	
	state = DF.Pick ( Warehouse, "Address.State" );
	return User.WarehousesStates.FindRows ( new Structure ( "State", state ) ).Count () > 0;
	
EndFunction
